<?php
// Bubble sort O(n^2)
// [2, 5, 3, 2, 7, 4, 0]
// 1. -
// 2. [2, 3, 5, 2, 7, 4, 0] swap
// 3. [2, 3, 2, 5, 7, 4, 0] swap
// 4. [2, 3, 2, 5, 7, 4, 0] -
// 5. [2, 3, 2, 5, 4, 7, 0] swap
// 6. [2, 3, 2, 5, 4, 0, 7] swap


// 7. [2, 3, 2, 5, 4, 0, 7] -
// 8. [2, 2, 3, 5, 4, 0, 7] swap
// 9. [2, 2, 3, 5, 4, 0, 7] -
// 9. [2, 2, 3, 4, 5, 0, 7] swap
// 10.[2, 2, 3, 4, 0, 5, 7] swap

// 7. [2, 3, 2, 5, 4, 0, 7] -
// 8. [2, 2, 3, 5, 4, 0, 7] swap
// 9. [2, 2, 3, 5, 4, 0, 7] -
// 9. [2, 2, 3, 4, 5, 0, 7] swap

//// 8. [2, 2, 3, 5, 4, 0, 7] swap
//// 9. [2, 2, 3, 5, 4, 0, 7] -
//// 9. [2, 2, 3, 4, 5, 0, 7] swap
///
///


$nums = [2, 5, 3, 2, 7, 4, 0]; // count = 7
$count = 0;

// todo: каждый раз пробегаемся по всему массиву
for ($i = 1; $i < count($nums); $i++) { // количество проходов
    for ($j = 0; $j < count($nums) - $i; $j++) { // какие мы пары мы смотрим
        $count++;
        if ($nums[$j] > $nums[$j + 1]) {
            $tmp = $nums[$j];
            $nums[$j] = $nums[$j + 1];
            $nums[$j + 1] = $tmp;
        }
    }
}

//for ($i = 0; $i < count($nums); $i++) {
//    echo $nums[$i] . ' ';
//}
var_dump($count);
// [4, 3, 2, 1]

// [3, 2, 1, 4]
// [2, 1, 3, 4]
// [1, 2, 3, 4]